{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "_copy", 
      "name": "id", 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "_minus_scalar", 
      "name": "_minusscalar0", 
      "attrs": {"scalar": "127.5"}, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar0", 
      "attrs": {"scalar": "0.0078125"}, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_head_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "40", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vargface_head_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "40", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_head_conv1_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_head_conv1_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_head_conv1_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_head_conv1_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vargface_head_conv1_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0], [8, 0, 1], [9, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargface_head_conv1_act_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "vargface_head_conv1_act", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_sep1_data_conv2d_depthwise_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "40", 
        "num_group": "5", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vargface_head_head_pooling_sep1_data_conv2d_depthwise", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "40", 
        "num_group": "5", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_sep1_data_conv2d_depthwise_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_sep1_data_conv2d_depthwise_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_sep1_data_conv2d_depthwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_sep1_data_conv2d_depthwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vargface_head_head_pooling_sep1_data_conv2d_depthwise_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[14, 0, 0], [15, 0, 0], [16, 0, 0], [17, 0, 1], [18, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_sep1_data_conv2d_depthwise_act_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "vargface_head_head_pooling_sep1_data_conv2d_depthwise_act", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_sep1_data_conv2d_pointwise_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "40", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vargface_head_head_pooling_sep1_data_conv2d_pointwise", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "40", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_sep1_data_conv2d_pointwise_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_sep1_data_conv2d_pointwise_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_sep1_data_conv2d_pointwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_sep1_data_conv2d_pointwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vargface_head_head_pooling_sep1_data_conv2d_pointwise_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 1], [27, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_sep1_data_conv2d_pointwise_act_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "vargface_head_head_pooling_sep1_data_conv2d_pointwise_act", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_sep2_data_conv2d_depthwise_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "40", 
        "num_group": "5", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vargface_head_head_pooling_sep2_data_conv2d_depthwise", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "40", 
        "num_group": "5", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_sep2_data_conv2d_depthwise_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_sep2_data_conv2d_depthwise_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_sep2_data_conv2d_depthwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_sep2_data_conv2d_depthwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vargface_head_head_pooling_sep2_data_conv2d_depthwise_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0], [35, 0, 1], [36, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_sep2_data_conv2d_depthwise_act_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "vargface_head_head_pooling_sep2_data_conv2d_depthwise_act", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_sep2_data_conv2d_pointwise_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "40", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vargface_head_head_pooling_sep2_data_conv2d_pointwise", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "40", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_sep2_data_conv2d_pointwise_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_sep2_data_conv2d_pointwise_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_sep2_data_conv2d_pointwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_sep2_data_conv2d_pointwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vargface_head_head_pooling_sep2_data_conv2d_pointwise_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0], [44, 0, 1], [45, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_shortcut_conv2d_depthwise_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "40", 
        "num_group": "5", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vargface_head_head_pooling_shortcut_conv2d_depthwise", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "40", 
        "num_group": "5", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": [[12, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_shortcut_conv2d_depthwise_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_shortcut_conv2d_depthwise_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_shortcut_conv2d_depthwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_shortcut_conv2d_depthwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vargface_head_head_pooling_shortcut_conv2d_depthwise_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0], [50, 0, 0], [51, 0, 1], [52, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_shortcut_conv2d_depthwise_act_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "vargface_head_head_pooling_shortcut_conv2d_depthwise_act", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_shortcut_conv2d_pointwise_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "40", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vargface_head_head_pooling_shortcut_conv2d_pointwise", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "40", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_shortcut_conv2d_pointwise_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_shortcut_conv2d_pointwise_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_shortcut_conv2d_pointwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_shortcut_conv2d_pointwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vargface_head_head_pooling_shortcut_conv2d_pointwise_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[57, 0, 0], [58, 0, 0], [59, 0, 0], [60, 0, 1], [61, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[46, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_head_head_pooling_out_data_act_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "vargface_head_head_pooling_out_data_act", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep1_data_branch_conv2d_depthwise_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "80", 
        "num_group": "5", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vargface_stage_2_unit_1_sep1_data_branch_conv2d_depthwise", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "80", 
        "num_group": "5", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": [[65, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep1_data_branch_conv2d_depthwise_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep1_data_branch_conv2d_depthwise_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep1_data_branch_conv2d_depthwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep1_data_branch_conv2d_depthwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vargface_stage_2_unit_1_sep1_data_branch_conv2d_depthwise_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0], [69, 0, 0], [70, 0, 1], [71, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep1_data_branch_conv2d_depthwise_act_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "vargface_stage_2_unit_1_sep1_data_branch_conv2d_depthwise_act", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep1_data_branch_conv2d_pointwise_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "80", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vargface_stage_2_unit_1_sep1_data_branch_conv2d_pointwise", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "80", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep1_data_branch_conv2d_pointwise_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep1_data_branch_conv2d_pointwise_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep1_data_branch_conv2d_pointwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep1_data_branch_conv2d_pointwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vargface_stage_2_unit_1_sep1_data_branch_conv2d_pointwise_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[76, 0, 0], [77, 0, 0], [78, 0, 0], [79, 0, 1], [80, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep2_data_branch_conv2d_depthwise_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "80", 
        "num_group": "5", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vargface_stage_2_unit_1_sep2_data_branch_conv2d_depthwise", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "80", 
        "num_group": "5", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": [[65, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep2_data_branch_conv2d_depthwise_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep2_data_branch_conv2d_depthwise_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep2_data_branch_conv2d_depthwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep2_data_branch_conv2d_depthwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vargface_stage_2_unit_1_sep2_data_branch_conv2d_depthwise_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[83, 0, 0], [84, 0, 0], [85, 0, 0], [86, 0, 1], [87, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep2_data_branch_conv2d_depthwise_act_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "vargface_stage_2_unit_1_sep2_data_branch_conv2d_depthwise_act", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep2_data_branch_conv2d_pointwise_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "80", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vargface_stage_2_unit_1_sep2_data_branch_conv2d_pointwise", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "80", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep2_data_branch_conv2d_pointwise_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep2_data_branch_conv2d_pointwise_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep2_data_branch_conv2d_pointwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep2_data_branch_conv2d_pointwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vargface_stage_2_unit_1_sep2_data_branch_conv2d_pointwise_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[92, 0, 0], [93, 0, 0], [94, 0, 0], [95, 0, 1], [96, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[81, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep1_data_act_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "vargface_stage_2_unit_1_sep1_data_act", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep2_data_conv2d_depthwise_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "160", 
        "num_group": "10", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vargface_stage_2_unit_1_sep2_data_conv2d_depthwise", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "160", 
        "num_group": "10", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[100, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep2_data_conv2d_depthwise_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep2_data_conv2d_depthwise_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep2_data_conv2d_depthwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep2_data_conv2d_depthwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vargface_stage_2_unit_1_sep2_data_conv2d_depthwise_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[102, 0, 0], [103, 0, 0], [104, 0, 0], [105, 0, 1], [106, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep2_data_conv2d_depthwise_act_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "vargface_stage_2_unit_1_sep2_data_conv2d_depthwise_act", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[107, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep2_data_conv2d_pointwise_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "80", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vargface_stage_2_unit_1_sep2_data_conv2d_pointwise", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "80", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[109, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep2_data_conv2d_pointwise_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep2_data_conv2d_pointwise_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep2_data_conv2d_pointwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_sep2_data_conv2d_pointwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vargface_stage_2_unit_1_sep2_data_conv2d_pointwise_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[111, 0, 0], [112, 0, 0], [113, 0, 0], [114, 0, 1], [115, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_shortcut_conv2d_depthwise_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "80", 
        "num_group": "5", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vargface_stage_2_unit_1_shortcut_conv2d_depthwise", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "80", 
        "num_group": "5", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": [[65, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_shortcut_conv2d_depthwise_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_shortcut_conv2d_depthwise_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_shortcut_conv2d_depthwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_shortcut_conv2d_depthwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vargface_stage_2_unit_1_shortcut_conv2d_depthwise_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[118, 0, 0], [119, 0, 0], [120, 0, 0], [121, 0, 1], [122, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_shortcut_conv2d_depthwise_act_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "vargface_stage_2_unit_1_shortcut_conv2d_depthwise_act", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[123, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_shortcut_conv2d_pointwise_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "80", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vargface_stage_2_unit_1_shortcut_conv2d_pointwise", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "80", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[125, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_shortcut_conv2d_pointwise_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_shortcut_conv2d_pointwise_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_shortcut_conv2d_pointwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_shortcut_conv2d_pointwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vargface_stage_2_unit_1_shortcut_conv2d_pointwise_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[127, 0, 0], [128, 0, 0], [129, 0, 0], [130, 0, 1], [131, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[116, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_1_out_data_act_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "vargface_stage_2_unit_1_out_data_act", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[133, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_2_sep1_data_conv2d_depthwise_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "160", 
        "num_group": "10", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vargface_stage_2_unit_2_sep1_data_conv2d_depthwise", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "160", 
        "num_group": "10", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[135, 0, 0], [136, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_2_sep1_data_conv2d_depthwise_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_2_sep1_data_conv2d_depthwise_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_2_sep1_data_conv2d_depthwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_2_sep1_data_conv2d_depthwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vargface_stage_2_unit_2_sep1_data_conv2d_depthwise_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[137, 0, 0], [138, 0, 0], [139, 0, 0], [140, 0, 1], [141, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_2_sep1_data_conv2d_depthwise_act_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "vargface_stage_2_unit_2_sep1_data_conv2d_depthwise_act", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[142, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_2_sep1_data_conv2d_pointwise_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "80", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vargface_stage_2_unit_2_sep1_data_conv2d_pointwise", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "80", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[144, 0, 0], [145, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_2_sep1_data_conv2d_pointwise_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_2_sep1_data_conv2d_pointwise_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_2_sep1_data_conv2d_pointwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_2_sep1_data_conv2d_pointwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vargface_stage_2_unit_2_sep1_data_conv2d_pointwise_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[146, 0, 0], [147, 0, 0], [148, 0, 0], [149, 0, 1], [150, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_2_sep1_data_conv2d_pointwise_act_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "vargface_stage_2_unit_2_sep1_data_conv2d_pointwise_act", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[151, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_2_sep2_data_conv2d_depthwise_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "160", 
        "num_group": "10", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vargface_stage_2_unit_2_sep2_data_conv2d_depthwise", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "160", 
        "num_group": "10", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[153, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_2_sep2_data_conv2d_depthwise_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_2_sep2_data_conv2d_depthwise_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_2_sep2_data_conv2d_depthwise_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_2_sep2_data_conv2d_depthwise_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vargface_stage_2_unit_2_sep2_data_conv2d_depthwise_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[155, 0, 0], [156, 0, 0], [157, 0, 0], [158, 0, 1], [159, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_2_sep2_data_conv2d_depthwise_act_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "vargface_stage_2_unit_2_sep2_data_conv2d_depthwise_act", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[160, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_2_sep2_data_conv2d_pointwise_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "80", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vargface_stage_2_unit_2_sep2_data_conv2d_pointwise", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "80", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[162, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_2_sep2_data_conv2d_pointwise_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vargface_stage_2_unit_2_sep2_data_conv2d_pointwise_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
